{
  "backend/main.mo": "Motoko actor managing listings, inquiries, and user profiles with authorization, filtering, and CRUD/query operations.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all major frontend source files.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables defining a warm light/dark color theme.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theming, and profile setup dialog for the app.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component handling Internet Identity login/logout with loading states and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to enter their display name and save their profile.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper blocking access to protected content and showing a login prompt when unauthenticated.",
  "frontend/src/components/inquiries/RentalInquiryForm.tsx": "Form to submit a rental inquiry with date validation, login requirement, and mutation handling.",
  "frontend/src/components/layout/AppHeader.tsx": "Application header with navigation links, user greeting, login button, and mobile menu.",
  "frontend/src/components/listings/ListingCard.tsx": "Displays a property listing in grid or list view with photo, details, and navigation to the listing page.",
  "frontend/src/components/listings/ListingFiltersBar.tsx": "Filter bar for listings allowing text, type, price, and city filters with search and reset controls.",
  "frontend/src/components/listings/ListingForm.tsx": "Form to create or edit a real estate listing with validation, photos, amenities, and address fields.",
  "frontend/src/components/listings/ListingPhotoGallery.tsx": "Photo gallery with main image, thumbnails, and a lightbox for navigating multiple listing photos.",
  "frontend/src/hooks/useActor.ts": "Creates an authenticated or anonymous actor via react-query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for CRUD operations on listings and inquiries using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Supplies hooks to fetch and update the caller's user profile through the actor.",
  "frontend/src/index.css": "Tailwind base styles with custom light and dark color palettes and global styling rules.",
  "frontend/src/lib/formatters.ts": "Utility functions to format prices, areas, and compact address strings.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, InternetIdentityProvider, and react-query's QueryClient.",
  "frontend/src/pages/BrowseListingsPage.tsx": "Listings browsing page with filters, pagination, grid/list view toggle, and loading/error states.",
  "frontend/src/pages/CreateListingPage.tsx": "Authenticated page for creating a new listing using a form and mutation handling.",
  "frontend/src/pages/EditListingPage.tsx": "Authenticated page allowing owners to edit an existing listing with loading and access checks.",
  "frontend/src/pages/InquiriesForMyListingsPage.tsx": "Displays inquiries for the user's own listings, allowing accepting or rejecting requests and switching between listings via tabs.",
  "frontend/src/pages/ListingDetailsPage.tsx": "Shows detailed information for a single listing, including photos, property details, and an inquiry form for users.",
  "frontend/src/pages/MyInquiriesPage.tsx": "Lists the user's submitted rental inquiries with status indicators and allows cancellation or navigation to related listings.",
  "frontend/src/pages/MyListingsPage.tsx": "Displays listings created by the user with options to create, edit, or delete listings and view their status.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query string and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins used across the project.",
  "project_state.json": "Stores project metadata, required images, and a list of existing frontend features for a real‑estate listings app. Includes versioning, descriptions, and requirement links for implemented features."
}